In [1]:
 !pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\dev\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\dev\anaconda3\lib\site-packages (from ipython-sql) (3.8.0)
Requirement already satisfied: ipython in c:\users\dev\anaconda3\lib\site-packages (from ipython-sql) (8.12.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\dev\anaconda3\lib\site-packages (from ipython-sql) (2.0.20)
Requirement already satisfied: sqlparse in c:\users\dev\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in c:\users\dev\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\dev\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\dev\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.6.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dev\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: backcall in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: pygments>=2.4.0 in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: colorama in c:\users\dev\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\dev\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\dev\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\dev\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\dev\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\dev\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
 %load_ext sql

In [3]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\dev\anaconda3\lib\site-packages (2.0.20)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\dev\anaconda3\lib\site-packages (from sqlalchemy) (4.6.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dev\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [4]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\dev\anaconda3\lib\site-packages (2.9.7)
Note: you may need to restart the kernel to use updated packages.

In [5]:
%sql postgresql://postgres:sabihinmo123@localhost:5432/Airlines

### Concatenate all Column as my GUIDE view ###

In [15]:
%%sql
SELECT table_name,
    STRING_AGG(column_name,',') AS Column_name
FROM information_schema.columns
WHERE table_schema = 'public'
GROUP BY table_name;

 * postgresql://postgres:***@localhost:5432/Airlines
8 rows affected.

[('airports', 'city,airport_code,coordinates,timezone,airport_name'),
 ('tickets', 'passenger_id,ticket_no,passenger_name,book_ref,contact_data'),
 ('seats', 'seat_no,aircraft_code,fare_conditions'),
 ('flights', 'flight_id,scheduled_arrival,actual_departure,status,scheduled_departure,aircraft_code,arrival_airport,departure_airport,actual_arrival,flight_no'),
 ('aircrafts', 'range,aircraft_code,model'),
 ('bookings', 'total_amount,book_ref,book_date'),
 ('ticket_flights', 'fare_conditions,amount,ticket_no,flight_id'),
 ('boarding_passes', 'flight_id,ticket_no,seat_no,boarding_no')]

### What is the average range of all aircraft models in the database? ###

In [7]:
%%sql 
SELECT
    ROUND (AVG(range),2) AS AVG_range_model,
    model->>'en' AS model_en
FROM aircrafts
GROUP BY model;

 * postgresql://postgres:***@localhost:5432/Airlines
9 rows affected.

[(Decimal('4200.00'), 'Boeing 737-300'),
 (Decimal('5700.00'), 'Airbus A320-200'),
 (Decimal('2700.00'), 'Bombardier CRJ-200'),
 (Decimal('7900.00'), 'Boeing 767-300'),
 (Decimal('3000.00'), 'Sukhoi Superjet-100'),
 (Decimal('5600.00'), 'Airbus A321-200'),
 (Decimal('11100.00'), 'Boeing 777-300'),
 (Decimal('6700.00'), 'Airbus A319-100'),
 (Decimal('1200.00'), 'Cessna 208 Caravan')]

###  Find the passenger(s) who made the highest total booking amount in a specific date range. ###

In [11]:
%%sql
SELECT t.passenger_name,
       SUM(b.total_amount) AS total_amount,
       DATE(b.book_date) AS Date
FROM tickets AS t
INNER JOIN bookings AS b
    ON t.book_ref = b.book_ref
GROUP BY t.passenger_name,b.book_date
    HAVING SUM(b.total_amount) IS NOT NULL AND DATE(b.book_date) IS NOT NULL
ORDER BY total_amount DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/Airlines
10 rows affected.

[('DMITRIY KUZMIN', Decimal('1204500.00'), datetime.date(2017, 7, 5)),
 ('DARYA TIKHONOVA', Decimal('1204500.00'), datetime.date(2017, 7, 5)),
 ('TATYANA SOROKINA', Decimal('1204500.00'), datetime.date(2017, 7, 5)),
 ('OKSANA KUZNECOVA', Decimal('1107800.00'), datetime.date(2017, 7, 8)),
 ('IRINA EFIMOVA', Decimal('1087100.00'), datetime.date(2017, 7, 31)),
 ('YURIY MAKAROV', Decimal('1087100.00'), datetime.date(2017, 7, 31)),
 ('ALEKSANDR GRIGOREV', Decimal('1087100.00'), datetime.date(2017, 7, 31)),
 ('VASILIY IVANOV', Decimal('1065600.00'), datetime.date(2017, 7, 3)),
 ('MAKSIM GORBUNOV', Decimal('1065600.00'), datetime.date(2017, 7, 3)),
 ('ALEKSANDR ABRAMOV', Decimal('1065600.00'), datetime.date(2017, 7, 3))]

### List the flights that were delayed (actual departure time > scheduled departure time). Include flight details such as flight number, departure airport, and arrival airport. ###

In [161]:
%%sql 
SELECT 
    flight_no,
    departure_airport, 
    arrival_airport,
       DATE(actual_departure) AS actual_departure,
       DATE(scheduled_departure) AS scheduled_departure,
           CASE 
               WHEN actual_departure > scheduled_departure THEN 'DELAYED'
       END AS status        
FROM flights
WHERE DATE(actual_departure) IS NOT NULL
ORDER BY flight_no, departure_airport, arrival_airport
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/Airlines
10 rows affected.

[('PG0001', 'UIK', 'SGC', datetime.date(2017, 7, 22), datetime.date(2017, 7, 22), 'DELAYED'),
 ('PG0001', 'UIK', 'SGC', datetime.date(2017, 7, 29), datetime.date(2017, 7, 29), 'DELAYED'),
 ('PG0001', 'UIK', 'SGC', datetime.date(2017, 8, 5), datetime.date(2017, 8, 5), 'DELAYED'),
 ('PG0001', 'UIK', 'SGC', datetime.date(2017, 8, 12), datetime.date(2017, 8, 12), 'DELAYED'),
 ('PG0002', 'SGC', 'UIK', datetime.date(2017, 7, 16), datetime.date(2017, 7, 16), 'DELAYED'),
 ('PG0002', 'SGC', 'UIK', datetime.date(2017, 7, 23), datetime.date(2017, 7, 23), 'DELAYED'),
 ('PG0002', 'SGC', 'UIK', datetime.date(2017, 7, 30), datetime.date(2017, 7, 30), 'DELAYED'),
 ('PG0002', 'SGC', 'UIK', datetime.date(2017, 8, 6), datetime.date(2017, 8, 6), 'DELAYED'),
 ('PG0002', 'SGC', 'UIK', datetime.date(2017, 8, 13), datetime.date(2017, 8, 13), 'DELAYED'),
 ('PG0003', 'IWA', 'AER', datetime.date(2017, 7, 18), datetime.date(2017, 7, 18), 'DELAYED')]

### Which airport has the highest number of departures and the highest number of arrivals? ###

In [85]:
%%sql 
SELECT arrival_airport, COUNT(*) AS arrival_count
FROM flights
GROUP BY arrival_airport
ORDER BY arrival_count DESC
LIMIT 3;

 * postgresql://postgres:***@localhost:5432/Airlines
3 rows affected.

[('DME', 3217), ('SVO', 2982), ('LED', 1902)]

In [86]:
%%sql
SELECT departure_airport, COUNT(*) AS departure_count
FROM flights
GROUP BY departure_airport
ORDER BY departure_count DESC
LIMIT 3;

 * postgresql://postgres:***@localhost:5432/Airlines
3 rows affected.

[('DME', 3217), ('SVO', 2981), ('LED', 1900)]

In [84]:
%%sql
WITH ArrivalCounts AS (
    SELECT arrival_airport, COUNT(*) AS arrival_count
    FROM flights
    GROUP BY arrival_airport
    ORDER BY arrival_count DESC
    LIMIT 1
),
DepartureCounts AS (
    SELECT departure_airport, COUNT(*) AS departure_count
    FROM flights
    GROUP BY departure_airport
    ORDER BY departure_count DESC
    LIMIT 1
)
SELECT 'Highest Arrival Airport' AS airport_type, arrival_airport AS airport, arrival_count
FROM ArrivalCounts
UNION ALL
SELECT 'Highest Departure Airport' AS airport_type, departure_airport AS airport, departure_count
FROM DepartureCounts;

 * postgresql://postgres:***@localhost:5432/Airlines
2 rows affected.

[('Highest Arrival Airport', 'DME', 3217),
 ('Highest Departure Airport', 'DME', 3217)]

### Find the most common fare condition for seats on all flights. ###

In [91]:
%%sql
SELECT fare_conditions, COUNT(*) AS most_common_flight
FROM ticket_flights 
GROUP BY fare_conditions
ORDER BY most_common_flight DESC

 * postgresql://postgres:***@localhost:5432/Airlines
3 rows affected.

[('Economy', 920793), ('Business', 107642), ('Comfort', 17291)]

### List the passenger(s) who have booked the most flights. ###

In [97]:
%%sql
SELECT passenger_name ,COUNT(*) AS passenger_book_count
FROM tickets
GROUP BY passenger_name
ORDER BY passenger_book_count DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/Airlines
10 rows affected.

[('ALEKSANDR IVANOV', 842),
 ('ALEKSANDR KUZNECOV', 755),
 ('SERGEY IVANOV', 634),
 ('SERGEY KUZNECOV', 569),
 ('VLADIMIR IVANOV', 551),
 ('ALEKSANDR POPOV', 488),
 ('VLADIMIR KUZNECOV', 463),
 ('ALEKSANDR PETROV', 429),
 ('ELENA KUZNECOVA', 428),
 ('TATYANA IVANOVA', 425)]

### Find the aircraft model with the largest number of flights in the database. ###

In [102]:
%%sql
SELECT a.model ->> 'en' AS aircraft_model,
       COUNT(f.flight_no) AS flight_Count
FROM aircrafts AS a
    INNER JOIN flights AS f
        ON a.aircraft_code = f.aircraft_code
GROUP BY a.model
ORDER BY flight_count DESC

 * postgresql://postgres:***@localhost:5432/Airlines
8 rows affected.

[('Cessna 208 Caravan', 9273),
 ('Bombardier CRJ-200', 9048),
 ('Sukhoi Superjet-100', 8504),
 ('Airbus A321-200', 1952),
 ('Boeing 737-300', 1274),
 ('Airbus A319-100', 1239),
 ('Boeing 767-300', 1221),
 ('Boeing 777-300', 610)]

### List all passengers who have flown from a specific departure airport to a specific arrival airport, and how many times each passenger has taken that route. ###

In [150]:
%%sql
SELECT 
    t.passenger_name,
    s.arrival_airport,
    s.departure_airport,
    COUNT( s.arrival_airport = s.departure_airport) AS route_count
FROM ticket_flights AS f
    INNER JOIN tickets AS t
        ON f.ticket_no = t.ticket_no
    INNER JOIN flights AS s
        ON  f.flight_id = s.flight_id
GROUP BY t.passenger_name,s.arrival_airport,s.departure_airport
ORDER BY  route_count DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/Airlines
10 rows affected.

[('ALEKSANDR KUZNECOV', 'SVX', 'SVO', 47),
 ('ALEKSANDR IVANOV', 'OVB', 'DME', 44),
 ('ALEKSANDR KUZNECOV', 'SVO', 'SVX', 44),
 ('ALEKSANDR IVANOV', 'DME', 'OVB', 39),
 ('ALEKSANDR KUZNECOV', 'OVB', 'DME', 38),
 ('ALEKSANDR KUZNECOV', 'DME', 'OVB', 36),
 ('ALEKSANDR IVANOV', 'SVX', 'SVO', 35),
 ('ALEKSANDR IVANOV', 'AER', 'SVO', 35),
 ('ALEKSANDR IVANOV', 'LED', 'SVO', 34),
 ('ALEKSANDR IVANOV', 'SVO', 'AER', 34)]

### Find the flight with the highest number of passengers on board and the number of passengers on that flight. ###

In [162]:
%%sql
SELECT 
    f.flight_no,
    COUNT(tic.ticket_no) AS number_of_passengers
FROM flights AS f
INNER JOIN ticket_flights AS t
    ON t.flight_id = f.flight_id
INNER JOIN tickets AS tic
    ON t.ticket_no = tic.ticket_no
GROUP BY f.flight_no 
ORDER BY number_of_passengers DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/Airlines
10 rows affected.

[('PG0222', 15903),
 ('PG0225', 15879),
 ('PG0226', 15433),
 ('PG0223', 15402),
 ('PG0224', 15155),
 ('PG0013', 14661),
 ('PG0277', 13160),
 ('PG0412', 13070),
 ('PG0413', 12876),
 ('PG0278', 12837)]